tap "base-infrastructure/taps", "https://github.bus.zalan.do/base-infrastructure/homebrew-taps"
tap "homebrew/autoupdate"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
brew "xz"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "awscli"
brew "coreutils"
brew "curl"
brew "emacs", link: false
brew "ffmpeg"
brew "libavif"
brew "gh"
brew "git"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gnumeric"
brew "gnuplot"
brew "graphviz"
brew "hledger"
brew "htop"
brew "irssi"
brew "jq"
brew "maven"
brew "ollama", restart_service: :changed
brew "openjdk@17"
brew "pipx"
brew "plantuml"
brew "postgresql@14"
brew "pre-commit"
brew "pv"
brew "pyenv"
brew "ripgrep"
brew "stow"
brew "swi-prolog"
brew "tcl-tk"
brew "tidy-html5"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "base-infrastructure/taps/zalando-aws-cli"
cask "emacs"
cask "font-cantarell"
cask "font-jetbrains-mono"
cask "raycast"
cask "temurin@17"
