tap "databricks/tap"
tap "homebrew/autoupdate"
tap "homebrew/services"
tap "zalando-build/taps", "git@github.com:zalando-build/homebrew-taps.git"
brew "xz"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "awscli"
brew "colima"
brew "coreutils"
brew "curl"
brew "docker"
brew "emacs", link: false
brew "ffmpeg"
brew "libavif"
brew "gh"
brew "git"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gnumeric"
brew "gnuplot"
brew "graphviz"
brew "hledger"
brew "htop"
brew "irssi"
brew "jq"
brew "maven"
brew "openjdk@17"
brew "pandoc"
brew "pipx"
brew "plantuml"
brew "postgresql@14"
brew "pre-commit"
brew "pv"
brew "pyenv"
brew "ripgrep"
brew "stow"
brew "swi-prolog"
brew "tcl-tk"
brew "tidy-html5"
brew "tree"
brew "uv"
brew "viu"
brew "watch"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "databricks/tap/databricks"
brew "zalando-build/taps/zalando-aws-cli"
cask "emacs-app"
cask "font-cantarell"
cask "font-jetbrains-mono"
cask "raycast"
cask "temurin@17"
vscode "anthropic.claude-code"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.makefile-tools"
vscode "vscodevim.vim"
